---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
source: html/11efb7aa-b16b-9c73-bd14-86c3ba4d75c6.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir

A constraint which can be applied to a RebarShapeSegment and drives the angle
 of the segment relative to a fixed direction in UV-space.

## Syntax (C#)
```csharp
public class RebarShapeConstraintAngleFromFixedDir : RebarShapeConstraint
```